# Rows

## Get Started (Load a DataFrame)

In [1]:
import pandas as pd
import numpy as np

In [2]:
filename = "../ZZ_Data/cars.csv"
colsIwannaUse = ["Name", "Miles_per_Gallon", "Acceleration", "Horsepower"]
dfOrg = pd.read_csv(filename, usecols=colsIwannaUse)
df = dfOrg.copy()
df = df.set_index("Name")
reorderCols = ["Acceleration", "Horsepower", "Miles_per_Gallon"]
df = df[reorderCols]
df.head(3)

                           Acceleration  Horsepower  Miles_per_Gallon
Name
chevrolet chevelle malibu          12.0       130.0              18.0
buick skylark 320                  11.5       165.0              15.0
plymouth satellite                 11.0       150.0              18.0

## Sort

In [3]:
### Sort by a single column
df = df.sort_values(by="Acceleration", ascending=True)

In [4]:
### Sort by multiple columns in various directions
sortCols = ["Acceleration", "Horsepower"]
direction =[True, False]
df = df.sort_values(by=sortCols, ascending=direction)
df[13:15]

                              Acceleration  Horsepower  Miles_per_Gallon
Name
buick electra 225 custom              11.0       225.0              12.0
chrysler new yorker brougham          11.0       215.0              13.0

## Get row

### Get row by number (iloc)

In [5]:
### Get nth row
n = 5
row = df.iloc[[n]]
row

                    Acceleration  Horsepower  Miles_per_Gallon
Name
pontiac grand prix           9.5       230.0              16.0

In [6]:
### Get every kth row, all columns
start = 10
end = 80
k = 37
rows = df.iloc[start:end:k,:]
print(rows)

                     Acceleration  Horsepower  Miles_per_Gallon
Name
dodge challenger se          10.0       170.0              15.0
chrysler cordoba             12.2       190.0              15.5

In [7]:
### Get every kth row between a start and an end row, all columns
start = 10
end = 80
k = 37
rows = df.iloc[start:end:k,:]
rows

                     Acceleration  Horsepower  Miles_per_Gallon
Name
dodge challenger se          10.0       170.0              15.0
chrysler cordoba             12.2       190.0              15.5

### Get row by value (loc)

In [8]:
df = df.reset_index()
dfFordCountry = df.loc[df["Name"] == "ford country"]
dfFordCountry

            Name  Acceleration  Horsepower  Miles_per_Gallon
51  ford country          12.5       167.0              12.0

In [9]:
### Get using a list of items
items = ["ford country", "ford galaxie 500"]
dfSomeFords = df.loc[df["Name"].isin(items)]
dfSomeFords

                Name  Acceleration  Horsepower  Miles_per_Gallon
9   ford galaxie 500          10.0       198.0              15.0
51      ford country          12.5       167.0              12.0
67  ford galaxie 500          13.0       153.0              14.0
87  ford galaxie 500          13.5       153.0              14.0

In [10]:
### Get using substring in index
dfAllFords = df.loc[df["Name"].str.contains("ford")]
dfAllFords.head()

                     Name  Acceleration  Horsepower  Miles_per_Gallon
1   ford mustang boss 302           8.0       140.0               NaN
9        ford galaxie 500          10.0       198.0              15.0
12            ford torino          10.5       140.0              17.0
19       ford torino (sw)          11.0       153.0               NaN
23            ford futura          11.2       139.0              18.1

In [11]:
### Get rows on a condition on values
dfSelected = df.loc[(df["Miles_per_Gallon"] < 11.0) & ((df["Acceleration"] < 18.0))]
dfSelected

          Name  Acceleration  Horsepower  Miles_per_Gallon
107  ford f250          14.0       215.0              10.0
172  chevy c20          15.0       200.0              10.0

## Adding rows

In [12]:
### Step 1: Create a row in the structure of a dataframe based on the existing column names
columnNames = list(df.columns.values)
dfNewRows = pd.DataFrame(columns=columnNames)
dfNewRows.loc[0] = ["myNewCar"] + list((np.random.uniform(20, 80, 3)).round(1))
dfNewRows

       Name  Acceleration  Horsepower  Miles_per_Gallon
0  myNewCar          59.7        44.0              59.9

In [13]:
### Step 2: Append the new row to the existing df
df = df.append(dfNewRows, ignore_index=True)
df.tail()

                   Name  Acceleration  Horsepower  Miles_per_Gallon
402   volkswagen type 3          23.5        54.0              23.0
403  vw dasher (diesel)          23.7        48.0              43.4
404           vw pickup          24.6        52.0              44.0
405         peugeot 504          24.8        71.0              27.2
406            myNewCar          59.7        44.0              59.9

In [14]:
### For adding many rows, it is more efficient to concatenate the new dataframe
dfMultiRows = pd.DataFrame(columns=columnNames)
for i in range(3):
    dfMultiRows.loc[i] = ['myNewCar' + str(i)] + list((np.random.uniform(20, 80, 3)).round(1))

df = pd.concat([df, dfMultiRows], axis=0)
df.tail()

            Name  Acceleration  Horsepower  Miles_per_Gallon
405  peugeot 504          24.8        71.0              27.2
406     myNewCar          59.7        44.0              59.9
0      myNewCar0          36.2        45.4              29.2
1      myNewCar1          76.5        37.6              53.2
2      myNewCar2          41.5        54.1              62.4

## Deleting rows

In [15]:
### Instead of dropping rows, you would typically slice the existing dataframe and continue working with the remaining df
### However, you can also drop specific rows, e.g. using the index
df = df.drop(df[df.Name == "myNewCar2"].index)

df = df.set_index("Name")
df = df.drop(index = 'myNewCar1')
print(df.tail())

                    Acceleration  Horsepower  Miles_per_Gallon
Name
vw dasher (diesel)          23.7        48.0              43.4
vw pickup                   24.6        52.0              44.0
peugeot 504                 24.8        71.0              27.2
myNewCar                    59.7        44.0              59.9
myNewCar0                   36.2        45.4              29.2

## Modifing by rows

In [16]:
### Replace an existing value in a specific column
df = df.reset_index()
df["Name"] = df["Name"].str.replace("myNewCar", "SportsCar")
df.tail()

                   Name  Acceleration  Horsepower  Miles_per_Gallon
402  vw dasher (diesel)          23.7        48.0              43.4
403           vw pickup          24.6        52.0              44.0
404         peugeot 504          24.8        71.0              27.2
405           SportsCar          59.7        44.0              59.9
406          SportsCar0          36.2        45.4              29.2

In [17]:
### Modify column Z based on values in column A
df["Environment"] = "NaN"
df.loc[df['Miles_per_Gallon'] > 20, ['Environment']] = 'Ok'
df = df.sort_values(by="Miles_per_Gallon", ascending=True)
df.tail(15)

,Name,Acceleration,Horsepower,Miles_per_Gallon,Environment
394,volkswagen rabbit custom diesel,21.5,48.0,43.1,Ok
402,vw dasher (diesel),23.7,48.0,43.4,Ok
403,vw pickup,24.6,52.0,44.0,Ok
395,vw rabbit c (diesel),21.7,48.0,44.3,Ok
103,honda civic 1500 gl,13.8,67.0,44.6,Ok
326,mazda glc,17.9,65.0,46.6,Ok
405,SportsCar,59.7,44.0,59.9,Ok
1,ford mustang boss 302,8.0,140.0,NaN,NaN
10,plymouth satellite (sw),10.5,175.0,NaN,NaN
17,amc rebel sst (sw),11.0,175.0,NaN,NaN
18,ford torino (sw),11.0,153.0,NaN,NaN
30,chevrolet chevelle concours (sw),11.5,165.0,NaN,NaN
195,saab 900s,15.4,110.0,NaN,NaN
312,citroen ds-21 pallas,17.5,115.0,NaN,NaN
381,volkswagen super beetle 117,20.0,48.0,NaN,NaN